insert into publishskill (uid,title,content,publishdate,stopdate,img,skilltype,iscomplete,isonline,addressdesc,longitude,latitude)
values (100,"动画制作1","专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍",
"2018-04-09 19:36:08", "2018-04-09 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic1.JPG",
"动画制作", 0, 1,"江西师范大学", 122.3, 28.7),
(101,"动画制作2","专业的动画制作2，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍",
"2018-04-09 19:36:08", "2018-04-09 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic2.JPG",
"动画制作", 0, 1,"江西师范大学", 122.3, 28.7),
(102,"动画制作3","专业的动画制作3，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍",
"2018-04-09 19:36:08", "2018-04-09 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic3.JPG",
"动画制作", 0, 1,"江西师范大学", 122.3, 28.7),
(103,"动画制作3","专业的动画制作4，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍",
"2018-04-09 19:36:08", "2018-04-09 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic4.JPG",
"动画制作", 0, 1,"江西师范大学", 122.3, 28.7),
(104,"动画制作4","专业的动画制作5，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍",
"2018-04-09 19:36:08", "2018-04-09 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic5.JPG",
"动画制作", 0, 1,"江西师范大学", 122.3, 28.7),
(105,"动画制作5","专业的动画制作6，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍",
"2018-04-09 19:36:08", "2018-04-09 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic6.GIF",
"动画制作", 0, 1,"江西师范大学", 122.3, 28.7),
(106,"测试数据","测试测试测试测试，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍，专业的动画制作1，为您打造顶级演示效果，这里是具体的内容介绍",
"2018-04-09 19:36:08", "2018-04-09 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic7.JPG",
"动画制作", 1, 1,"江西师范大学", 122.3, 28.7),
(102,"UI设计制作1","专业的UI设计1制作效果，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍",
"2018-04-08 19:36:08", "2018-04-10 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1478.JPG",
"UI设计", 0, 1,"江西师范大学", 122.3, 28.7),
(104,"UI设计制作2","专业的UI设计2制作效果，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍",
"2018-04-08 19:36:08", "2018-04-10 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1479.JPG",
"UI设计", 0, 1,"江西师范大学", 122.3, 28.7),
(103,"UI设计制作3","专业的UI设计3制作效果，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍",
"2018-04-08 19:36:08", "2018-04-10 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1480.JPG",
"UI设计", 0, 1,"江西师范大学", 122.3, 28.7),
(105,"UI设计制作4","专业的UI设计5制作效果，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍",
"2018-04-08 19:36:08", "2018-04-10 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1481.PNG",
"UI设计", 0, 1,"江西师范大学", 122.3, 28.7),
(107,"UI设计制作5","专业的UI设计5制作效果，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍",
"2018-04-08 19:36:08", "2018-04-10 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1482.JPG",
"UI设计", 0, 1,"江西师范大学", 122.3, 28.7),
(106,"测试数据","专业的UI设计1制作效果，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍，专业的UI设计制作效果1，为您提供顶级人机交互体验，这里是具体的内容介绍",
"2018-04-08 19:36:08", "2018-04-10 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1483.JPG",
"UI设计", 0, 0,"江西师范大学", 122.3, 28.7),
(103,"网页设计/制作制作1","专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示，专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示，专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1489.JPG",
"网页设计/制作", 0, 1,"江西师范大学", 122.3, 28.7),
(104,"平面设计1","专业的平面设计1，打造顶级平面设计样式，这里是具体的内容显示，专业的平面设计1，打造顶级平面设计样式，这里是具体的内容显示，专业的平面设计1，打造顶级平面设计样式，这里是具体的内容显示",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1488.JPG",
"平面设计", 0, 1,"江西师范大学", 122.3, 28.7),
(105,"网页设计/制作制作1","专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示，专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示，专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1487.JPG",
"网页设计/制作", 0, 1,"江西师范大学", 122.3, 28.7),
(103,"视频/后期制作制作1","专业的视频/后期制作制作团队1，移动端视频/后期制作定制,专业的视频/后期制作制作团队1，移动端视频/后期制作定制,专业的视频/后期制作制作团队1，移动端视频/后期制作定制,专业的视频/后期制作制作团队1，移动端视频/后期制作定制",
"2018-04-03 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1486.JPG",
"视频/后期制作", 0, 1,"江西师范大学", 122.3, 28.7),
(100,"App开发制作1","专业的App开发制作1，打造顶级App制作团队，这里是具体的内容介绍，专业的App开发制作1，打造顶级App制作团队，这里是具体的内容介绍，专业的App开发制作1，打造顶级App制作团队，这里是具体的内容介绍",
"2018-04-06 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1483.JPG",
"App开发", 0, 1,"江西师范大学", 122.3, 28.7),
(101,"程序语言设计1","专业的程序语言设计1，打造顶级语言程序设计，这里是具体的内容显示，专业的程序语言设计2，打造顶级语言程序设计，这里是具体的内容显示，专业的程序语言设计2，打造顶级语言程序设计，这里是具体的内容显示",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic6.GIF",
"程序语言设计", 0, 1,"江西师范大学", 122.3, 28.7),
(101,"排版设计/制作制作1","专业的排版设计/制作制作1，打造顶级排版设计制作团队，这里是具体的内容介绍，专业的排版设计/制作制作1，打造顶级排版设计制作团队，这里是具体的内容介绍，专业的排版设计/制作制作1，打造顶级排版设计制作团队，这里是具体的内容介绍",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic3.JPG",
"排版设计/制作", 0, 1,"江西师范大学", 122.3, 28.7),

(103,"网页设计/制作制作2","专业的网页设计/制作原型制作2，制作出色的网页展示效果，这里是具体的内容显示，专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示，专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1489.JPG",
"网页设计/制作", 0, 1,"江西师范大学", 122.3, 28.7),
(106,"平面设计2","专业的平面设计2，打造顶级平面设计样式，这里是具体的内容显示，专业的平面设计1，打造顶级平面设计样式，这里是具体的内容显示，专业的平面设计1，打造顶级平面设计样式，这里是具体的内容显示",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1488.JPG",
"平面设计", 0, 1,"江西师范大学", 122.3, 28.7),
(107,"网页设计/制作制作2","专业的网页设计/制作原型制作2，制作出色的网页展示效果，这里是具体的内容显示，专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示，专业的网页设计/制作原型制作1，制作出色的网页展示效果，这里是具体的内容显示",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1487.JPG",
"网页设计/制作", 0, 1,"江西师范大学", 122.3, 28.7),
(101,"视频/后期制作制作2","专业的视频/后期制作制作团队2，移动端视频/后期制作定制,专业的视频/后期制作制作团队1，移动端视频/后期制作定制,专业的视频/后期制作制作团队1，移动端视频/后期制作定制,专业的视频/后期制作制作团队1，移动端视频/后期制作定制",
"2018-04-03 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1486.JPG",
"视频/后期制作", 0, 1,"江西师范大学", 122.3, 28.7),
(102,"App开发制作2","专业的App开发制作2，打造顶级App制作团队，这里是具体的内容介绍，专业的App开发制作1，打造顶级App制作团队，这里是具体的内容介绍，专业的App开发制作1，打造顶级App制作团队，这里是具体的内容介绍",
"2018-04-06 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/SKILL_1483.JPG",
"App开发", 0, 1,"江西师范大学", 122.3, 28.7),
(104,"程序语言设计2","专业的程序语言设计2，打造顶级语言程序设计，这里是具体的内容显示，专业的程序语言设计2，打造顶级语言程序设计，这里是具体的内容显示，专业的程序语言设计2，打造顶级语言程序设计，这里是具体的内容显示",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic6.GIF",
"程序语言设计", 0, 1,"江西师范大学", 122.3, 28.7),
(106,"排版设计/制作制作2","专业的排版设计/制作制作2，打造顶级排版设计制作团队，这里是具体的内容介绍，专业的排版设计/制作制作1，打造顶级排版设计制作团队，这里是具体的内容介绍，专业的排版设计/制作制作1，打造顶级排版设计制作团队，这里是具体的内容介绍",
"2018-04-07 19:36:08", "2018-04-11 19:36:08", "http://192.168.191.1:8080/fragment_server/images/skill_pre_img/lx_fgpic3.JPG",
"排版设计/制作", 0, 1,"江西师范大学", 122.3, 28.7);

drop table if exists orders;
create table orders(
id int(11) primary key auto_increment,	-- 订单号（主键）
uid int(11) not null,	-- 用户id（当前登录者）
uid_s int(11) not null,	-- 技能拥有者id
skillid int (11) not null,  -- 技能id
title varchar(60),  -- 技能标题
content text,
img varchar(300),
skilltype varchar(50),
create_time datetime,	-- 创建日期
ispay boolean,	-- 是否付款
isdelete boolean, -- 是否删除
iscomment boolean,  -- 是否评论
foreign key (skillid) references publishskill(id),   -- 外键约束
foreign key (uid) references person(id)
)ENGINE=InnoDB DEFAULT CHARSET=utf8 auto_increment=1000000;

insert into orders (uid, uid_s, skillid, title, content, img, skilltype, create_time, ispay, isdelete, iscomment) values(101, 103, 53, "视频/后期制作制作1", "专业的视频/后期制作制作团队1，移动端视频/后期制作定制,专业的视频/后期制作制作团队1，移动端视频/后期制作定制,专业的视频/后期制作制作团队1，移动端视频/后期制作定制,专业的视频/后期制作制作团队1，移动端视频/后期制作定制"
, "http://172.20.10.3:8080/fragment_server/images/skill_pre_img/SKILL_1486.JPG", "视频/后期制作",
now(), 1, 0, 0);

insert into orders values(null, 101, 106, 58, "平面设计2", "专业的平面设计2，打造顶级平面设计样式，这里是具体的内容显示，专业的平面设计1，打造顶级平面设计样式，这里是具体的内容显示，专业的平面设计1，打造顶级平面设计样式，这里是具体的内容显示"
, "http://172.20.10.3:8080/fragment_server/images/skill_pre_img/SKILL_1488.JPG", "平面设计",
now(), 1, 0, 0);